/*
    Basic : การเขียนโปรแกรมกับการใช้งานเสียงดนตรีบนบอร์ดไมโครคอนโทรลเลอร์ HONEYLemon
*/
#include <HONEYLemon.h>

void setup()
{
    lemon.begin();          // เรียกใช้งานฟังก์ชั่นเริ่มต้นของบอร์ด HONEYLemon

    Serial.begin(115200);   // เรียกใช้งาน Serial
    lemon.debug(Serial);    // ขอดู debug ของบอร์ด HONEYLemon ผ่าน Serial
}

void loop()
{
    /*
        tone(
            1000,   // ความถี่เสียง
            100     // ระยะเวลาที่เล่น (มิลลิวินาที) (option)
        );

        noTone()    // สั่งให้หยุดเล่นเสียงดนตรี
    */
    lemon.tone(1000);   // สั่งให้เล่นเสียงความถี่ 1000 Hz
    delay(100);         // รอ 100 มิลลิวินาที (0.1 วินาที)

    lemon.noTone();     // สั่งให้หยุดเล่นเสียงดนตรี
    delay(100);         // รอ 100 มิลลิวินาที (0.1 วินาที)

    lemon.tone(2000,500);   // สั่งให้เล่นเสียงดนตรีความถี่ 2000 Hz เป็นเวลา 500 มิลลิวินาที ( 0.5 วินาที ) แล้วหยุดเล่นเสียงนั้น
    delay(100);         // รอ 1000 มิลลิวินาที (1 วินาที)
}